# -*- coding: ISO-8859-1 -*-
"""Resource rotate_icon_png (from file rotate_icon.png)"""
# written by resourcepackage: (1, 0, 0)
source = 'rotate_icon.png'
package = 'neveredit.resources.images'

### wxPython specific functions
originalExtension = '.png'
import wx
import io
def getData( ):
	"""Return the data from the resource as a simple string"""
	return data
def getImage( ):
	"""Return the data from the resource as a wxImage"""
	stream = io.BytesIO(data.encode('latin1'))
	return wx.Image(stream)
def getBitmap( ):
	"""Return the data from the resource as a wxBitmap"""
	return wx.Bitmap(getImage())
def getIcon( ):
	"""Return the data from the resource as a wxIcon"""
	icon = wx.Icon()
	icon.CopyFromBitmap(getBitmap())
	return icon
data = "‰PNG\015\012\032\012\000\000\000\015IHDR\000\000\000\032\000\000\000\030\010\002\000\000\000kàz’\000\000\000\003sBIT\010\010\010ÛáOà\000\000\005`IDAT8…”\
ßoUU\026Ç×Z{Ÿ{~ÝÛÞ¶¶·\002ZD\013ˆ\012£H\000V\030‚úbŒ¾\013ht\022ÆÄ„™Œ!!£MÄÄ·y™Ä7\023&™\
\010\022Äh‘ÀmmF\032D4$JéïÛ{{{¸½÷œ½÷Z>\0340ó`f¾\017;YÉÎw}“ýÝ\037œžž¾·2(\010\000ŒˆÀ(È\"\
\012Q€\020\030QX\020òA\020P\030…œBb\021A\015Î!\001\000\"6›M=77W,\026‰À\011\023iaD\000\024f\002åDP2ÎiÀà\000\010€ˆÈ\
9ƒˆ€\012DD\034\021‰H’$\032\000êõº8&\005Ž\001\021\021Q\004\001¬ !\"° ¢8^•Î\",,ðâb¶üRp\020\025(Ô\"ù\016\000\000­µ\
\006\000\021Aí±\010\021£€\000($\006…ŒkÜ®ÁÂ\034×fq¹É\015Ï4bç>]™:Ð?\022û\001\022\000*ø/i\004V\004\002ŒH\000(à€ñ–Ì\
ÏñR\015ægdÁçT§õRÖÚ`ZY;C\001'+É•Ýj'\007Š\000s#D\004\000-@\010\036£YÊ–\026¨6ïj³2¯)Uv94«[\
MlâÆ÷Ã£_¤VÊÞp»ÕÞ_\032ª¶®<YúC\001\004ï¾ƒˆ ¢\006`A¨uêo/¿{°¼­\004í‡8ålÍZ+\026Z€º\
uï¦®®[yòÂØWk«_³¯“•dðÍM¶ÇV¯Nîyj7\012üæ¨Å‘ˆøYX»¶’nø~¨Òc™1l´\023ŽÍý\
^}ç7cí\035¨¼úç]sÉ56\026¨ÿ£ž\033\027¿½ðÑ‡\037~æ3AÊ£9ç4*¶¶Ó6­mzøêÊµ‡Ê]†YŒ²œ\
9'ÿxo2m_Ì\000¬µíNË¤ÆY\013Ö=\030GÍxêÔ)F¨^º¼wï^\000`f-\"ž\027*×ØŒ›þ½6ÑÉ\0348\020kS\013\
ƒ…-¯½#µ”AÖZI²¶lRë,Yv\033Ò®\011óÝ‹îÕêÄ±cÇÎž=›7D\023\"*P:ØQ|øÃùd5é\004\036\030‡\
bhºsÕf†-:\013ÆYfv\006L–ÞnwV’ÎÁ†]gwïÚsîÜ9\021!\"\000Ð,â+/ˆüžbï}nýõÚê#}}Î¤\
7¯'•¡-XÇÖI;1?­6o,Õ\027\026Rw\033\037è½ïùø\031c\034)«Taß¾}çÏŸ\007\000M Hù¾§ã(Ø\036<òcçò\
æNäœÿÅ'µWÞ\030œ©'SKË33ÍÕ\025SQë6vmÛ»þþ­ƒÃ}}ýëÖ¯×Z\013\000\021\035?~\\)%\"Ú¡x\005ôÂ(\
\014ËÛãáKõ/o.Þ¾¶xËmiþk2´Å-¥MÏUž\036\036~°\034G\005?ö}/\012Âîž®¾Þ®0.h\012‰èèÑ£ccc\
ˆ¨\0251¢ò•Ž‹ácåíÍsíÎý´©4\024üÀG^~ýžrwÁó\012¾\037†q\030†Åb1\014Ã0\014ã8Žã8Š\"ÏSDtâ\
Ä\011¥” àxõâÖ‡wX›5šõù[‹ã×«ª–%Ö!Å…Ø\017ŠQ\034EQPŒ¢ ôïJ)åy\036\021)¥ò\002‹H£¹¢\005\
4\021\021ébT*õ´\036\033z4i­\021H\030\007GŽ\034yë­?mßñxXðüÀSº[LMMÍÎÎ\016\014\014\000@~nÜ¸ñNQXP\021C\
\001QÂþÞ>ß÷Œ\021bðãð½¿üí©gŸ!­\012Ú#\002D…ˆµZÍ\0303::Úh4Êår\020\004gÎœÉÓ\001€FD\020R$Tà\"\
•ý Èl\025jòôÁ\027^@\005»wíùû\007ïŒŒäû+•J³ÙÌc\036>|x`` Gdþm5 +¯Àà\0241y¤E\0030É\035â\
0Âû£\037Œ<·ÿÐ¡Cß\\øº»»ÛZ[*•\016\03480==\035EQ¾&÷bf\030¯^²6ë¸Ô\031ëŒå¬m­uÆfÆYk1\
6s63Ö¤“““§OŸž˜˜0ÆXkOž<yçÂ]ý|ó\027¬NŒï|ü\011`\001R‚ŒÂ9Ü\005ˆ„\005Y\020r|ç ú\037šž¹\
¥Å1\021\011Š\010\023`\016kD@\020@DPøÛuü\035‹¼%w\006\026Ýßßßl6ó1ÇÖÿÉð{ÊMÃ0ü\025—§\013ÝÄ Ë±\000\000\000\000\
IEND®B`‚"
### end
